Revit 2026 API

# ColorOptionsSelectionColor Property

---

The color of the current canvas theme used to highlight selected elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color SelectionColor { get; set; }
```
```vb
Public Property SelectionColor As Color
	Get
	Set
```
```cpp
public:
property Color^ SelectionColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member SelectionColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ColorOptions Class

Autodesk.Revit.DB Namespace